DLC6p1/background/constant/probeDefinitions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      loggingProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

wavegauge
{
    type waveGauge;

    pointDistribution lineDistribution;
    N 1;
    linestart (325 314.5 -20);
    lineend   (325.1 314.5 -20);
    add       ( 0 0 50);
    axis      z;
    stretch 1.0;

    // REQURIED ONLY FOR NEW FUNCTIONOBJECT IMPLEMENTATION
    writeControl timeStep;
    writeInterval 5;
}

// ************************************************************************* //
