DLC6p1/background/system/topoSetDictRough
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../myVars" //Include global variables
radiusRough	#eval "2.5*$D/2" ;
actions
(
    
    {
        name    waterLineRough;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
     	 box ($xmin  #eval "$ymin" #eval "-8*$wave_height") ($xmax  #eval "$ymax" #eval "8.0*$wave_height");
   	}
    }
    
    
    {
   	 // Mandatory (inherited) entries
    	name        combinedRough;
    	type        cellZoneSet;
    	action      new;

    	// Mandatory entries
    	source      setToCellZone;
    	set         waterLineRough;
    }  
    

   

    
);


// ************************************************************************* //
